In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
df=sns.load_dataset('tips')

### 1. What is the average total_bill for each day and time?

In [4]:
df.pivot_table(index='time',columns='day',values='total_bill',aggfunc='mean').fillna(0)

day          Thur        Fri        Sat    Sun
time
Lunch   17.664754  12.845714   0.000000   0.00
Dinner  18.780000  19.663333  20.441379  21.41

### 2. What is the average tip given for each sex and smoker status?

In [5]:
df.pivot_table(index='sex',columns='smoker',values='tip',aggfunc='mean')

smoker       Yes        No
sex
Male    3.051167  3.113402
Female  2.931515  2.773519

### 3. How does the average total_bill change with party size across different days?

In [7]:
df.pivot_table(index='day',columns='size',values='total_bill',aggfunc='mean').fillna(0)

size      1          2          3          4      5          6
day
Thur  10.07  15.156875  19.160000  29.950000  41.19  30.383333
Fri    8.58  16.321875  15.980000  40.170000   0.00   0.000000
Sat    5.16  16.837170  25.509444  29.876154  28.15   0.000000
Sun    0.00  17.560000  22.184000  26.688333  27.00  48.170000

### 4. What is the average tip for each time and size?

In [8]:
df.pivot_table(index="time",columns='size',values='tip',aggfunc='mean')

size        1         2      3       4      5    6
time
Lunch   1.875  2.423077  2.754  4.2180  5.000  5.3
Dinner  1.000  2.661923  3.490  4.1225  3.785  5.0

### 5. How does the average total_bill differ between males and females across times?

In [9]:
df.pivot_table(index='sex',columns='time',values='total_bill',aggfunc='mean')

time        Lunch     Dinner
sex
Male    18.048485  21.461452
Female  16.339143  19.213077

### 6. What is the average tip by day and time for smokers versus non-smokers?

In [11]:
df.pivot_table(index=['day','time'],columns='smoker',values='tip',aggfunc='mean').fillna(0)

smoker            Yes        No
day  time
Thur Lunch   3.030000  2.666364
     Dinner  0.000000  3.000000
Fri  Lunch   2.280000  3.000000
     Dinner  3.003333  2.750000
Sat  Dinner  2.875476  3.102889
Sun  Dinner  3.516842  3.167895

### 7. What is the average total_bill for different days and sizes of parties?

In [13]:
df.pivot_table(index='day',columns='size',values='total_bill',aggfunc='mean').fillna(0)

size      1          2          3          4      5          6
day
Thur  10.07  15.156875  19.160000  29.950000  41.19  30.383333
Fri    8.58  16.321875  15.980000  40.170000   0.00   0.000000
Sat    5.16  16.837170  25.509444  29.876154  28.15   0.000000
Sun    0.00  17.560000  22.184000  26.688333  27.00  48.170000

### 8. How does the average tip differ between smokers and non-smokers across different sizes of parties?

In [15]:
df.pivot_table(index='smoker',columns='size',values='tip',aggfunc='mean').fillna(0)

size        1         2         3         4         5      6
smoker
Yes     1.460  2.709545  4.095000  3.992727  2.500000  0.000
No      1.415  2.489000  3.069231  4.195769  5.046667  5.225

### 9. What is the average total_bill by day and time for different sizes of parties?

In [17]:
df.pivot_table(index=['day','time'],columns='size',values='total_bill',aggfunc='mean').fillna(0)

size             1          2          3          4      5          6
day  time
Thur Lunch   10.07  15.079787  19.160000  29.950000  41.19  30.383333
     Dinner   0.00  18.780000   0.000000   0.000000   0.00   0.000000
Fri  Lunch    8.58  13.072000  15.980000   0.000000   0.00   0.000000
     Dinner   0.00  17.799091   0.000000  40.170000   0.00   0.000000
Sat  Dinner   5.16  16.837170  25.509444  29.876154  28.15   0.000000
Sun  Dinner   0.00  17.560000  22.184000  26.688333  27.00  48.170000

### 10. What is the average tip given by sex and day?

In [18]:
df.pivot_table(index='sex',columns='day',values='tip',aggfunc='mean')

day         Thur       Fri       Sat       Sun
sex
Male    2.980333  2.693000  3.083898  3.220345
Female  2.575625  2.781111  2.801786  3.367222